[
    {
        "id": "1",
        "value": "tab1",
        "title": "Grocery List Helper",
        "description": "An app to help a user store fun activities and turn them into dates. Built with JavaScript, HTML, CSS, and JSON server.",
        "bullets": [

        ],
        "youtube": "https://www.youtube.com/embed/uDf8yGIArYw",
        "github": [{"description": "GitHub Monorepo", "link":"https://github.com/gdurant34/phase1-project-shopping-list-builder"}]
    },
    {
        "id": "2",
        "value": "tab2",
        "title": "Financial Goals",
        "description": "An app to empower users' financial decisions by providing a system to enter account balances, track transactions, and create financial goals.",
        "bullets": [
            "Programmed a single-page web application with streamlined navigation for a seamless user experience by applying fundamental React and React Router patterns",
            "Developed a lightweight interactive interface to increase user motivation and engagement by employing intuitive data visualization techniques for goal progress representation",
            "Researched solutions to ensure accurate floating-point calculations resulting in improved accuracy and reliability by implementing an external 3rd party library",
            "Leveraged Chrome/React Devtools and strategic console statements to monitor app state and methodically debug errors, leading to improved stability "
        ],
        "youtube": "https://www.youtube.com/embed/SM_UWHfj3_8",
        "github": [{"description": "GitHub Monorepo", "link":"https://github.com/gdurant34/financial_goals_phase_2_project"}]
    },
    {
        "id": "3",
        "value": "tab3",
        "title": "Movie Social",
        "description": "A movie library app with search functionality, enabling users to save, rate, and review films. ",
        "bullets": [
            "Integrated a comprehensive RESTful API featuring ~500,000 movies and TV shows, enabling partial title search functionality resulting in a more efficient and accessible user experience",
            "Implemented Semantic-UI React, providing a quick solution for consistent design to expedite development time yielding a visually appealing user interface",
            "Incorporated full CRUD capabilities in a lightweight Sinatra back-end to handle frontend requests for data resulting in seamless data management and manipulation"
        ],
        "youtube": "https://www.youtube.com/embed/LZ0wNL8z3N4",
        "github": [
            {"description":"GitHub Front-end Repo", "link":"https://github.com/gdurant34/project-movie-social"},
            {"description":"GitHub Back-end Repo", "link":"https://github.com/gdurant34/phase-3-movie-social"}
        ]
    },
    {
        "id": "4",
        "value": "tab4",
        "title": "It's a Date",
        "description": "An app for users to create and store fun activities to turn into date nights.",
        "bullets": [
            "Optimized React app with Recoil, reducing dependencies between components to improve maintainability, scalability, and readability",
            "Built back-end with full CRUD capabilities and validations in Ruby on Rails, increasing data management and data integrity throughout the application ",
            "Employed Bcrypt hashing on the back-end and authentication routes on the front-end to ensure user privacy "
        ],
        "youtube": "https://www.youtube.com/embed/SZPFzpYK7As",
        "github": [{"description": "GitHub Monorepo", "link":"https://github.com/gdurant34/phase-5-project-its-a-date"}]
    }
]