[
    {
        "id": "1",
        "value": "tab1",
        "title": "Financial Goals",
        "description": "An app for informed financial decisions: manage balances, track transactions, and set goals.",
        "bullets": [
            "Programmed a single-page web application with streamlined navigation by applying fundamental React and React Router patterns",
            "Developed a lightweight interactive interface for React to visualize goal progress bar",
            "Researched solutions and implemented a 3rd party library to achieve accurate floating-point calculations",
            "Leveraged Chrome/React Devtools and strategic console statements to monitor app state and methodically debug errors, leading to improved stability "
        ],
        "video": "https://www.youtube-nocookie.com/embed/SM_UWHfj3_8",
        "github": [{"description": "GitHub Monorepo", "link":"https://github.com/gdurant34/financial_goals_phase_2_project"}],
        "websiteInfo": null
    },
    {
        "id": "2",
        "value": "tab2",
        "title": "Movie Social",
        "description": "A movie library app with search, save, rate, and review films.",
        "bullets": [
            "Incorporated an extensive RESTful API, enabling efficient partial title searches for a vast movie and TV show database",
            "Incorporated full CRUD capabilities in Sinatra back-end to handle data requests resulting in seamless data management",
            "Implemented Semantic-UI React, providing a quick solution for consistent design to expedite development time"
        ],
        "video": "https://www.youtube-nocookie.com/embed/LZ0wNL8z3N4",
        "github": [
            {"description":"GitHub Front-end Repo", "link":"https://github.com/gdurant34/project-movie-social"},
            {"description":"GitHub Back-end Repo", "link":"https://github.com/gdurant34/phase-3-movie-social"}
        ],
        "websiteInfo": null
    },
    {
        "id": "3",
        "value": "tab3",
        "title": "It's a Date",
        "description": "An app for users to create and store fun activities to turn into date nights.",
        "bullets": [
            "Boosted React app's stability and scalability by optimizing with Recoil, reducing component dependencies",
            "Employed Bcrypt hashing on the back-end and authentication routes on the front-end to ensure user privacy ",
            "Built back-end with full CRUD capabilities and validations in Ruby on Rails, increasing data management and data integrity throughout the application "
        ],
        "video": "https://www.youtube-nocookie.com/embed/SZPFzpYK7As",
        "github": [{"description": "GitHub Monorepo", "link":"https://github.com/gdurant34/phase-5-project-its-a-date"}],
        "websiteInfo": null
    },
    {
        "id": "4",
        "value": "tab4",
        "title": "Friends of Grace",
        "description": "A CRM tool to help a user keep track of friends, and contact information.",
        "bullets": [
            "Implemented user authentication, registration, and session management utilizing the Devise Gem",
            "Executed deployment through Render with PostgreSQL configuration",
            "Created a full-stack Ruby/Ruby on Rails app with robust CRUD scaffolding, partials, and associations",
            "Enhanced user experience and intuitiveness by applying Bootstrap for app styling"
        ],
        "video": "https://www.loom.com/embed/127378af496242d9911aee70ad63b9f4?sid=92ae9c1d-0ed6-4cfa-a87c-25e9ff42f8f1",
        "github": [{"description": "GitHub Monorepo", "link":"https://github.com/gdurant34/grace-friends"}],
        "websiteInfo": [{"description": "Web App", "link":"https://friends-kgrn.onrender.com/users/sign_up"}]
    }, 
    {
        "id": "5",
        "value": "tab5",
        "title": "Portfolio/My Website",
        "description": "My personal website.",
        "bullets": [
            "Built a scalable codebase utilizing a monorepo setup in order to modularize functionality via library design",
            "Created an efficient developer experience by extending best-in-class tooling, component libraries, and frameworks",
            "Achieved rapid and continuous deployment with a fully integrated CI/CD workflow to ensure consistent code standards and high software quality"
        ],
        "video": null,
        "github": [{"description": "GitHub Monorepo", "link":"https://github.com/gdurant34/grace-website"}],
        "websiteInfo": null
    }
]